//다차원 배열(multidimensional array) : 배열안에 배열이 있는 형태
// 2차원 배열 : 배열안에 배열이 있는 형태
let twoDimensional = [[1, 2], [3, 4]];
console.log(twoDimensional[0][1]); // 2

let myFridge = [['참외', '토마토', '오이', '양파'], //0번
                ['볶음멸치', '장조림', '김치'], //1번
                ['사이다', '콜라', '물', '쥬스'], //2번
                ['사과', '바나나', '청포도'], //3번
                ['얼음'], //4번
                ['찰떡아이스', '투게더', '메로나'] //5번
]

let mailbox = [
    [101, 201, 301, 401, 501, 601],
    [102, 202, 302, 402, 502, 602],
    [103, 203, 303, 403, 503, 603],
    [104, 204, 304, 404, 504, 604],
    [105, 205, 305, 405, 505, 605],
];

let chessBoard = [
    ['R', 'N', 'B', 'Q', 'K', 'B', 'N', 'R'],
    ['P', 'P', 'P', 'P', 'P', 'P', 'P', 'P'],
    ['', '', '', '', '', '', '', ''],
    ['', '', '', '', '', '', '', ''],
    ['', '', '', '', '', '', '', ''],
    ['', '', '', '', '', '', '', ''],
    ['p', 'p', 'p', 'p', 'p', 'p', 'p', 'p'],
    ['r', 'n', 'b', 'q', 'k', 'b', 'n', 'r']
];


//객체로 변경
let otherFridge = {
    fridge: {
            '채소층': ['참외', '토마토', '오이', '양파'], //0번
            '반찬층': ['볶음멸치', '장조림', '김치'], //1번
            '음료층': ['사이다', '콜라', '물', '쥬스'], //2번
            '과일층': ['사과', '바나나', '청포도'], //3번
    },
    freezer: {
             '얼음층': ['얼음'], //4번
             '아이스크림층': ['찰떡아이스', '투게더', '메로나']
    }
};
